# Taps
tap "FelixKratz/formulae"
tap "fluxcd/tap"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"

# Core CLI tools
brew "bash"
brew "bash-completion2"
brew "bat"
brew "cmake"
brew "coreutils"
brew "findutils"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "kanata"
brew "lua"
brew "make"
brew "moreutils"
brew "neovim"
brew "node"
brew "openssh"
brew "pkg-config"
brew "pngpaste"
brew "pv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "zoxide"
brew "zsh"

# Services and specialty tools
brew "koekeishiya/formulae/skhd"
brew "FelixKratz/formulae/sketchybar"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "kubernetes-cli"
cask "1password-cli"
brew "fluxcd/tap/flux"
brew "gh"

# Casks
cask "aerospace"
cask "alacritty"
cask "docker"
cask "font-fira-code-nerd-font"
cask "karabiner-elements"
cask "kitty"
cask "spotify"
